print ("Визначення, чи є трикутник рівнобедренним\n-----------------------------------------------")
a = int(input("Введіть сторону a: "))
b = int(input("Введіть сторону b: "))
c = int(input("Введіть сторону c: "))

if a <= 0 or b <= 0 or c <= 0:
    print("Помилка!")
else:
    if a == b and a == b and b == c:
        print("Трикутник рівносторонній, але не рівнобедрений!")
    else:
        if a + b <= c or b + c <= a or a + c <= b:
            print("Помилка!")
        else:
            if a == b or b == c or c == a:
                print ("Трикутник рівнобедренний!")
            else:
                print ("Трикутник не є рівнобедреним!")
